app/views/pics/_photo.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]
---
  <div class=<%= tagClass %> style="left:<%= tag.x_coord %>px; top:<%= tag.y_coord %>px; width:<%= tag.width %>px; height:<%= tag.height %>px">
  <% @tagged = User.find(tag.user_id) %>