app/views/pics/tag.html.erb

SELECT "users".* FROM "users"
---
      <% if session[:user] %>
        <% user_array = User.all.map { |user| [user.first_name + " " + user.last_name, user.id] } %>

SELECT COUNT(*) FROM "tags" WHERE "tags"."photo_id" = 1
---
    <table>
    <% if @photo.tags.count != 0 %>