app/views/pics/user.html.erb

      <span class="photo-info">
        <% commentLabel = photo.comments.count.to_s + " comment" %>
---
SELECT COUNT(*) FROM "comments" WHERE "comments"."photo_id" = 1

      <span class="photo-info">
        <% tagLabel = photo.tags.count.to_s + " tag" %>
---
SELECT COUNT(*) FROM "tags" WHERE "tags"."photo_id" = 1