app/controllers/pics_controller.rb

  def users
    @userList = []
    for user in User.find(:all)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def search_results
    @resultPhotos = Photo.all
    if (params[:substr] != nil)
      if (!params[:substr].empty?)
        substring = params[:substr]
        @resultPhotos = []
        for comment in Comment.all
          if comment.comment.downcase =~ /#{substring}(.*)/
            photo = Photo.find(comment.photo_id)
            if !@resultPhotos.include?(photo)
              @resultPhotos = @resultPhotos + [photo]
            end
          end
        end
        for tag in Tag.all
          user = User.find(tag.user_id)
---
SELECT "photos".* FROM "photos"
SELECT "comments".* FROM "comments"
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "tags".* FROM "tags"
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", "1"]]

  def post_photo
    if params[:photo] == nil
      redirect_to(:action => :photo)
      return
    end

    # Save File to directory
    fileName = params[:photo][:file].original_filename
    directory = "public/images"
    path = File.join(directory, fileName)
    File.open(path, "wb") { |f| f.write(params[:photo][:file].read) }

    # Update database
    photo = Photo.new
    photo.user_id = session[:user]
    photo.date_time = DateTime.now
    photo.file_name = fileName
    photo.save
---
INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["date_time", Sun, 27 Jan 2013 01:44:34 UTC +00:00], ["file_name", "acorns.jpg"], ["user_id", 1]]

  def tag
    @photo = Photo.find(params[:id])
---
SELECT "photos".* FROM "photos" WHERE "photos"."id" = $1 LIMIT 1  [["id", "1"]]

  def post_tag
    @tag = Tag.new()
    @tag.photo_id = params[:id]
    @tag.user_id = params[:tag][:user_id]
    @tag.x_coord = params[:tag][:x_coord]
    @tag.y_coord = params[:tag][:y_coord]
    @tag.width = params[:tag][:width]
    @tag.height = params[:tag][:height]
    @tag.save
---
INSERT INTO "tags" ("height", "photo_id", "user_id", "width", "x_coord", "y_coord") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["height", 89], ["photo_id", 1], ["user_id", 1], ["width", 107], ["x_coord", 261], ["y_coord", 128]]