app/controllers/user_controller.rb

INSERT INTO "users" ("first_name", "last_name", "login", "password_digest", "salt") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["first_name", "blah"], ["last_name", "blah"], ["login", "hi"], ["password_digest", "698ddba56c0687cb4d51b572fbec8579ee386afb"], ["salt", "afcf9d7b549a885d108ad183968c98e0"]]
---
  def post_register
    @user = User.new(params[:user])
    @user.save